#!/usr/bin/env python3
# Chonlanna Saikhampa (Aomsin)
# 670510702
# Lab03_2
# 204111 Sec 003


def main():

    x = float(input("input x: "))
    area = rectangle_area(x)
    print(area)


def rectangle_area(x: float) -> float:
    area = ((2*x*(5**0.5))/7)**2
    return area


if __name__ == '__main__':
    main()


'''
ด้านตรงข้ามมุมฉาก = (((2*x)**2)+(x**2))**0.5 ตามสมบัติพิทาโกรัส
v/2x=u/x=a/x*(5**0.5)  ขั้นตอนที่ 1 กำหนดตัวแปล vและu แทนสามเหลี่ยมด้านเล็กที่ไม่ทราบค่า นำแต่ละด้านมาเท่ากันตามสมบัติสามเหลี่ยมคล้าย

ขั้นตอนที่ 2 นำแต่ละด้านมาเท่ากัน เพื่อหาค่า a
a/u=(x*(5**0.5))/x จะได้ a=u*(5**0.5)
a/v=(x*(5**0.5))/2x จะได้ a=(v*(5**0.5))/2
(((2*x)-v)/5**0.5)=a/x จะได้ a=((2*x)-v)/(5**0.5)
(x-u)/(x*(5**0.5))=a/(2*x) จะได้ a=(2*((x-u)/5**0.5))

ขั้นตอนที่ 3 จับสมการที่มีตัวแปลเดียวกันมาเท่ากัน
1) u*(5**0.5)=(2*((x-u)/5**0.5))
2) (v*(5**0.5))/2=((2*x)-v)/(5**0.5)

ขั้นตอนที่ 4 
เลือกทำสมการที่ 1 หรือ 2 ก็ได้
จะได้ a=((2*x*(5**0.5))/7)**2
'''